tap "d12frosted/emacs-plus"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "planetscale/tap"
tap "superfly/tap"
brew "ack"
brew "act"
brew "python@3.9"
brew "certbot"
brew "ctags"
brew "go"
brew "dep"
brew "docker", link: false
brew "docker-compose", link: false
brew "erlang"
brew "elixir"
brew "libevent"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "srt"
brew "ffmpeg"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "golang-migrate"
brew "librsvg"
brew "graphviz"
brew "hadolint"
brew "helm"
brew "highlight"
brew "hub"
brew "hyperkit"
brew "imagemagick"
brew "imagemagick@6"
brew "kubernetes-cli"
brew "luajit", args: ["HEAD"]
brew "luv"
brew "minikube"
brew "mysql-client"
brew "neovim"
brew "python@3.8"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "sphinx-doc"
brew "tmux"
brew "tree"
brew "vim"
brew "watchman"
brew "yarn"
brew "d12frosted/emacs-plus/emacs-plus@27"
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/terraform"
brew "planetscale/tap/pscale"
brew "superfly/tap/flyctl"
cask "adoptopenjdk8"
cask "aerial"
cask "figma"
cask "figmadaemon"
cask "licecap"
cask "ngrok"
cask "postico"
cask "postman"
cask "vlc"
cask "xquartz"
