tap "d12frosted/emacs-plus"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "nektos/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Reimplementation of ctags(1)
brew "ctags"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Asynchronous event library
brew "libevent"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Database migrations CLI tool
brew "golang-migrate"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# Library to render SVG files using Cairo
brew "librsvg"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Interpreted, interactive, object-oriented programming language
brew "python@2", link: false
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
brew "d12frosted/emacs-plus/emacs-plus@27", link: false
# Run GitHub Actions locally
brew "nektos/tap/act"
cask "adoptopenjdk8"
cask "aerial"
cask "figma"
cask "figmadaemon"
cask "licecap"
cask "ngrok"
cask "postico"
cask "postman"
cask "vlc"
cask "wine-stable"
cask "xquartz"
